anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register>
                    <name>F0CTR</name>
                    <description>F0CTR register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I0NTEN</name>
                            <description>I0 integrator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3NTEN</name>
                            <description>I3 integrator enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VASEL</name>
                            <description>Select source for FullEnergy</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FullEnergy</name>
                                    <description>I0DAT and VDAT can store FullEnergy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_RMS</name>
                                    <description>I0DAT and VDAT can store I_RMS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RARS</name>
                            <description>Active Energy Accumulator Reset</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RRRS</name>
                            <description>Reactive Energy Accumulator Reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RVRS</name>
                            <description>Full Energy Accumulator Reset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>I0GAIN</name>
                            <description>PGA value</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>x1</name>
                                    <description>Signal amplification 0dB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x2</name>
                                    <description>Signal amplification 6dB</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x4</name>
                                    <description>Signal amplification 12dB</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x8</name>
                                    <description>Signal amplification 18dB</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>VGAIN</name>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field>
                            <name>VPHASE</name>
                            <description>Phase V0 adjustment by step of +-124us</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>I3GAIN</name>
                            <bitOffset>18</bitOffset>
                        </field>
                        <field>
                            <name>IRMSOS</name>
                            <description>RMS calibration of channel I</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WC</name>
                    <description>Active energy calibration</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTOS</name>
                            <description>Calibration bias of active energy</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>WGAIN</name>
                            <description>Calibration gain of active energy</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTP</name>
                    <description>Positive Active Energy accumulator</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTHRP</name>
                            <description>High 32 bits of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTN</name>
                    <description>Negative Active Energy accumulator</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTHRN</name>
                            <description>High 32 bits of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VC</name>
                    <description>Reactive energy calibration</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VAROS</name>
                            <description>Calibration bias of reactive energy</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>VARGAIN</name>
                            <description>Calibration gain of reactive energy</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARP</name>
                    <description>Positive Reactive Energy accumulator</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VARHRP</name>
                            <description>High 32 bits of of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARN</name>
                    <description>Negative Reactive Energy accumulator</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VARHRN</name>
                            <description>High 32 bits of of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0AC</name>
                    <description>V0 RMS calibration</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0FFF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>VRMSOS</name>
                            <description>Calibration bias of V RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>VAGAIN</name>
                            <description>Calibration gain of Full energy</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VR</name>
                    <description>Full Energy accumulator</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VAHR</name>
                            <description>High 32 bits of of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0MD0</name>
                    <description>FxMD0 register</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFF1FF</resetMask>
                    <fields>
                        <field>
                            <name>VSEL</name>
                            <description>Select source for FxVDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_V</name>
                                    <description>ADC_V output</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ActivePower</name>
                                    <description>Active Power</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ReactivePower</name>
                                    <description>Reactive Power</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FullPower</name>
                                    <description>Full Power</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>Select source for FxI0DAT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_I0</name>
                                    <description>ADC_I0 output</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ActivePower</name>
                                    <description>Active Power</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ReactivePower</name>
                                    <description>Reactive Power</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FullPower</name>
                                    <description>Full Power</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACTS</name>
                            <description>Active Energy sign in last period</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Pos</name>
                                    <description>Positive sign</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Neg</name>
                                    <description>Negative sign</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="ACTS">
                            <name>REACTS</name>
                            <description>Reactive Energy sign in last period</description>
                            <bitOffset>5</bitOffset>
                        </field>
                        <field>
                            <name>I0GAIN</name>
                            <description>ADC Decimation gain</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>x1</name>
                                    <description>No gain</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x2</name>
                                    <description>Gain by +6dB</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>V0GAIN</name>
                            <bitOffset>7</bitOffset>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>I3GAIN</name>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field>
                            <name>PER_FREQ</name>
                            <description>Measured period in Voltage channel</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>I3SEL</name>
                            <description>Select source for FxI3DAT</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AfterLPF</name>
                                    <description>Signal after LPF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BeforeLPF</name>
                                    <description>ADC_I3 output</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL_I_CH</name>
                            <description>Select I for calc power</description>
                            <bitRange>[31:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Auto_max</name>
                                    <description>Select max of I0 and I3</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I0</name>
                                    <description>Calc Power by I0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I3</name>
                                    <description>Calc Power by I3</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0MD1</name>
                    <description>FxMD1 register</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IPKLVL</name>
                            <description>Imax level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>VPKLVL</name>
                            <description>Vmax level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VPEAK</name>
                    <description>VPEAK Result register</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IPEAK</name>
                            <description>Vmax measured, write any to clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
