anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register>
                    <name>F0IPEAK</name>
                    <description>IPEAK Result register</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IPEAK</name>
                            <description>Imax measured, write any to clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VDAT</name>
                    <description>VDAT Result register</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VDAT</name>
                            <description>FIFO of V or Power</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0I0DAT</name>
                    <description>I0DAT Result register</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IDAT</name>
                            <description>FIFO of I or Power</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0I3DAT</name>
                    <description>I3DAT Result register</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I3DAT</name>
                            <description>FIFO of I3 or Power</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS</name>
                    <description>VRMS Result register</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VRMS</name>
                            <description>RMS of V</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS2</name>
                    <description>VRMS^2 Result register</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VRMS2</name>
                            <description>RMS of V^2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS</name>
                    <description>IRMS Result register</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IRMS</name>
                            <description>RMS of I</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS2</name>
                    <description>IRMS^2 Result register</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IRMS2</name>
                            <description>RMS of I^2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x07FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VF_EMP</name>
                            <description>FIFO_VDAT is Empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VF_FLL</name>
                            <description>FIFO_VDAT is Full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VF_OVER</name>
                            <description>FIFO_VDAT is Overflow</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_EMP</name>
                            <description>FIFO_IDAT is Empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IF_FLL</name>
                            <description>FIFO_IDAT is Full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IF_OVER</name>
                            <description>FIFO_IDAT is Overflow</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAGF</name>
                            <description>V is less than CTRL2.SAGLVL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKVF</name>
                            <description>V exceeds F0MD1.VPKLVL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKIF</name>
                            <description>I exceeds F0MD1.VPKLVL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVP</name>
                            <description>FxWATTP value overflow</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVP</name>
                            <description>FxVARP value overflow</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAOV</name>
                            <description>FxVR value overflow</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZTXTOF</name>
                            <description>Timeout of V cross zero</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ICHANNEL</name>
                            <description>Timeout of V cross zero</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>I0</name>
                                    <description>I0 is active</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I3</name>
                                    <description>I3 is active</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FAULTCON</name>
                            <description>Active I switched</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APSIGN</name>
                            <description>ActivePower sign changed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APNLDFL</name>
                            <description>ActivePower less CNTL1.APNOLOAD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VARSIGN</name>
                            <description>ReactivePower sign changed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARNLDFL</name>
                            <description>ReactivePower less CNTL1.VARNOLOAD</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VANLDFL</name>
                            <description>FullPower less CNTL1.VANOLOAD</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ZEROCRS</name>
                            <description>V crossed zero</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3F_EMP</name>
                            <description>FIFO_I3DAT is Empty</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>I3F_FLL</name>
                            <description>FIFO_I3DAT is Full</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>I3F_OVER</name>
                            <description>FIFO_I3DAT is Overflow</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVN</name>
                            <description>FxWATTN value overflow</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVN</name>
                            <description>FxVARN value overflow</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0MASK</name>
                    <description>IRQ Mask Register</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x07FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VF_EMPM</name>
                            <description>FIFO_VDAT is Empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VF_FLLM</name>
                            <description>FIFO_VDAT is Full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VF_OVERM</name>
                            <description>FIFO_VDAT is Overflow</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_EMPM</name>
                            <description>FIFO_IDAT is Empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_FLLM</name>
                            <description>FIFO_IDAT is Full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_OVERM</name>
                            <description>FIFO_IDAT is Overflow</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAGFM</name>
                            <description>V is less than CTRL2.SAGLVL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKVFM</name>
                            <description>V exceeds F0MD1.VPKLVL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKIFM</name>
                            <description>I exceeds F0MD1.VPKLVL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVPM</name>
                            <description>FxWATTP value overflow</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVPM</name>
                            <description>FxVARP value overflow</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAOVM</name>
                            <description>FxVR value overflow</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZTXTOFM</name>
                            <description>Timeout of V cross zero</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FAULTCONM</name>
                            <description>Active I switched</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APSIGNM</name>
                            <description>ActivePower sign changed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APNLDFLM</name>
                            <description>ActivePower less CNTL1.APNOLOAD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARSIGNM</name>
                            <description>ReactivePower sign changed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARNLDFLM</name>
                            <description>ReactivePower less CNTL1.VARNOLOAD</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VANLDFLM</name>
                            <description>FullPower less CNTL1.VANOLOAD</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZEROCRSM</name>
                            <description>V crossed zero</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3F_EMPM</name>
                            <description>FIFO_I3DAT is Empty</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3F_FLLM</name>
                            <description>FIFO_I3DAT is Full</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3F_OVERM</name>
                            <description>FIFO_I3DAT is Overflow</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVNM</name>
                            <description>FxWATTN value overflow</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVNM</name>
                            <description>FxVARN value overflow</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
