anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register>
                    <name>F1CTR</name>
                    <description>FxCTR register</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>Integrator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VASEL</name>
                            <description>Select source for FullEnergy</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FullEnergy</name>
                                    <description>IDAT and VDAT can store FullEnergy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_RMS</name>
                                    <description>IDAT and VDAT can store I_RMS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RARS</name>
                            <description>Active Energy Accumulator Reset</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RRRS</name>
                            <description>Reactive Energy Accumulator Reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RVRS</name>
                            <description>Full Energy Accumulator Reset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IGAIN</name>
                            <description>PGA value</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>x1</name>
                                    <description>Signal amplification 0dB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x2</name>
                                    <description>Signal amplification 6dB</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x4</name>
                                    <description>Signal amplification 12dB</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x8</name>
                                    <description>Signal amplification 18dB</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="IGAIN">
                            <name>VGAIN</name>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field>
                            <name>VPHASE</name>
                            <description>Phase V adjustment by step of +-124us</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRMSOS</name>
                            <description>RMS calibration of channel I</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="F0WC">
                    <name>F1WC</name>
                    <description>Active energy calibration</description>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="F0WATTP">
                    <name>F1WATTP</name>
                    <description>Positive Active Energy accumulator</description>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register derivedFrom="F0WATTN">
                    <name>F1WATTN</name>
                    <description>Negative Active Energy accumulator</description>
                    <addressOffset>0x00000070</addressOffset>
                </register>
