anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register derivedFrom="F0VC">
                    <name>F1VC</name>
                    <description>Reactive energy calibration</description>
                    <addressOffset>0x00000074</addressOffset>
                </register>
                <register derivedFrom="F0VARP">
                    <name>F1VARP</name>
                    <description>Positive Reactive Energy accumulator</description>
                    <addressOffset>0x00000078</addressOffset>
                </register>
                <register derivedFrom="F0VARN">
                    <name>F1VARN</name>
                    <description>Negative Reactive Energy accumulator</description>
                    <addressOffset>0x0000007C</addressOffset>
                </register>
                <register derivedFrom="F0AC">
                    <name>F1AC</name>
                    <description>V RMS calibration</description>
                    <addressOffset>0x00000080</addressOffset>
                </register>
                <register derivedFrom="F0VR">
                    <name>F1VR</name>
                    <description>Full Energy accumulator</description>
                    <addressOffset>0x00000084</addressOffset>
                </register>
                <register>
                    <name>F1MD0</name>
                    <description>FxMD0 register</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1FFFF0FF</resetMask>
                    <fields>
                        <field>
                            <name>VSEL</name>
                            <description>Select source for FxVDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_V</name>
                                    <description>ADC_V output</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ActivePower</name>
                                    <description>Active Power</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ReactivePower</name>
                                    <description>Reactive Power</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FullPower</name>
                                    <description>Full Power</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>Select source for FxI0DAT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_I0</name>
                                    <description>ADC_I0 output</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ActivePower</name>
                                    <description>Active Power</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ReactivePower</name>
                                    <description>Reactive Power</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FullPower</name>
                                    <description>Full Power</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACTS</name>
                            <description>Active Energy sign in last period</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Pos</name>
                                    <description>Positive sign</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Neg</name>
                                    <description>Negative sign</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="ACTS">
                            <name>REACTS</name>
                            <description>Reactive Energy sign in last period</description>
                            <bitOffset>5</bitOffset>
                        </field>
                        <field>
                            <name>I1GAIN</name>
                            <description>ADC Decimation gain</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>x1</name>
                                    <description>No gain</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x2</name>
                                    <description>Gain by +6dB</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="I1GAIN">
                            <name>V1GAIN</name>
                            <bitOffset>7</bitOffset>
                        </field>
                        <field>
                            <name>PER_FREQ</name>
                            <description>Measured period in Voltage channel</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="F0MD1">
                    <name>F1MD1</name>
                    <description>FxMD1 register</description>
                    <addressOffset>0x0000008C</addressOffset>
                </register>
                <register>
                    <name>F1MD2</name>
                    <description>FxMD2 register</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001FFFF</resetMask>
                    <fields>
                        <field>
                            <name>PhaseV_toV0</name>
                            <description>Phase V1 ref to V0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="F0VPEAK">
                    <name>F1VPEAK</name>
                    <description>VPEAK Result register</description>
                    <addressOffset>0x00000094</addressOffset>
                </register>
