anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register derivedFrom="F0IPEAK">
                    <name>F1IPEAK</name>
                    <description>IPEAK Result register</description>
                    <addressOffset>0x00000098</addressOffset>
                </register>
                <register derivedFrom="F0VDAT">
                    <name>F1VDAT</name>
                    <description>VDAT Result register</description>
                    <addressOffset>0x0000009C</addressOffset>
                </register>
                <register derivedFrom="F0I0DAT">
                    <name>F1IDAT</name>
                    <description>I1DAT Result register</description>
                    <addressOffset>0x000000A0</addressOffset>
                </register>
                <register derivedFrom="F0VRMS">
                    <name>F1VRMS</name>
                    <description>VRMS Result register</description>
                    <addressOffset>0x000000A4</addressOffset>
                </register>
                <register derivedFrom="F0VRMS2">
                    <name>F1VRMS2</name>
                    <description>VRMS^2 Result register</description>
                    <addressOffset>0x000000A8</addressOffset>
                </register>
                <register derivedFrom="F0IRMS">
                    <name>F1IRMS</name>
                    <description>IRMS Result register</description>
                    <addressOffset>0x000000AC</addressOffset>
                </register>
                <register derivedFrom="F0IRMS2">
                    <name>F1IRMS2</name>
                    <description>IRMS^2 Result register</description>
                    <addressOffset>0x000000B0</addressOffset>
                </register>
                <register>
                    <name>F1STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x06379FFF</resetMask>
                    <fields>
                        <field>
                            <name>VF_EMP</name>
                            <description>FIFO_VDAT is Empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VF_FLL</name>
                            <description>FIFO_VDAT is Full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VF_OVER</name>
                            <description>FIFO_VDAT is Overflow</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_EMP</name>
                            <description>FIFO_IDAT is Empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IF_FLL</name>
                            <description>FIFO_IDAT is Full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IF_OVER</name>
                            <description>FIFO_IDAT is Overflow</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAGF</name>
                            <description>V is less than CTRL2.SAGLVL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKVF</name>
                            <description>V exceeds F0MD1.VPKLVL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKIF</name>
                            <description>I exceeds F0MD1.VPKLVL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVP</name>
                            <description>FxWATTP value overflow</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVP</name>
                            <description>FxVARP value overflow</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAOV</name>
                            <description>FxVR value overflow</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZTXTOF</name>
                            <description>Timeout of V cross zero</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APSIGN</name>
                            <description>ActivePower sign changed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APNLDFL</name>
                            <description>ActivePower less CNTL1.APNOLOAD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VARSIGN</name>
                            <description>ReactivePower sign changed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARNLDFL</name>
                            <description>ReactivePower less CNTL1.VARNOLOAD</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VANLDFL</name>
                            <description>FullPower less CNTL1.VANOLOAD</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ZEROCRS</name>
                            <description>V crossed zero</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVN</name>
                            <description>FxWATTN value overflow</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVN</name>
                            <description>FxVARN value overflow</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1MASK</name>
                    <description>IRQ Mask Register</description>
                    <addressOffset>0x000000B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x06379FFF</resetMask>
                    <fields>
                        <field>
                            <name>VF_EMPM</name>
                            <description>FIFO_VDAT is Empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VF_FLLM</name>
                            <description>FIFO_VDAT is Full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VF_OVERM</name>
                            <description>FIFO_VDAT is Overflow</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_EMPM</name>
                            <description>FIFO_IDAT is Empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_FLLM</name>
                            <description>FIFO_IDAT is Full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IF_OVERM</name>
                            <description>FIFO_IDAT is Overflow</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAGFM</name>
                            <description>V is less than CTRL2.SAGLVL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKVFM</name>
                            <description>V exceeds F0MD1.VPKLVL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEAKIFM</name>
                            <description>I exceeds F0MD1.VPKLVL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVPM</name>
                            <description>FxWATTP value overflow</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVPM</name>
                            <description>FxVARP value overflow</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAOVM</name>
                            <description>FxVR value overflow</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZTXTOFM</name>
                            <description>Timeout of V cross zero</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APSIGNM</name>
                            <description>ActivePower sign changed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APNLDFLM</name>
                            <description>ActivePower less CNTL1.APNOLOAD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARSIGNM</name>
                            <description>ReactivePower sign changed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VARNLDFLM</name>
                            <description>ReactivePower less CNTL1.VARNOLOAD</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VANLDFLM</name>
                            <description>FullPower less CNTL1.VANOLOAD</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZEROCRSM</name>
                            <description>V crossed zero</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WATTOVNM</name>
                            <description>FxWATTN value overflow</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VAROVNM</name>
                            <description>FxVARN value overflow</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="F1CTR">
                    <name>F2CTR</name>
                    <description>FxCTR register</description>
                    <addressOffset>0x000000BC</addressOffset>
                </register>
                <register derivedFrom="F0WC">
                    <name>F2WC</name>
                    <description>Active energy calibration</description>
                    <addressOffset>0x000000C0</addressOffset>
                </register>
                <register derivedFrom="F0WATTP">
                    <name>F2WATTP</name>
                    <description>Positive Active Energy accumulator</description>
                    <addressOffset>0x000000C4</addressOffset>
                </register>
                <register derivedFrom="F0WATTN">
                    <name>F2WATTN</name>
                    <description>Negative Active Energy accumulator</description>
                    <addressOffset>0x000000C8</addressOffset>
                </register>
