anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
                <register derivedFrom="F0VC">
                    <name>F2VC</name>
                    <description>Reactive energy calibration</description>
                    <addressOffset>0x000000CC</addressOffset>
                </register>
                <register derivedFrom="F0VARP">
                    <name>F2VARP</name>
                    <description>Positive Reactive Energy accumulator</description>
                    <addressOffset>0x000000D0</addressOffset>
                </register>
                <register derivedFrom="F0VARN">
                    <name>F2VARN</name>
                    <description>Negative Reactive Energy accumulator</description>
                    <addressOffset>0x000000D4</addressOffset>
                </register>
                <register derivedFrom="F0AC">
                    <name>F2AC</name>
                    <description>V RMS calibration</description>
                    <addressOffset>0x000000D8</addressOffset>
                </register>
                <register derivedFrom="F0VR">
                    <name>F2VR</name>
                    <description>Full Energy accumulator</description>
                    <addressOffset>0x000000DC</addressOffset>
                </register>
                <register derivedFrom="F1MD0">
                    <name>F2MD0</name>
                    <description>FxMD0 register</description>
                    <addressOffset>0x000000E0</addressOffset>
                </register>
                <register derivedFrom="F0MD1">
                    <name>F2MD1</name>
                    <description>FxMD1 register</description>
                    <addressOffset>0x000000E4</addressOffset>
                </register>
                <register>
                    <name>F2MD2</name>
                    <description>FxMD2 register</description>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001FFFF</resetMask>
                    <fields>
                        <field>
                            <name>PhaseV_toV0</name>
                            <description>Phase V2 ref to V0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="F0VPEAK">
                    <name>F2VPEAK</name>
                    <description>VPEAK Result register</description>
                    <addressOffset>0x000000EC</addressOffset>
                </register>
                <register derivedFrom="F0IPEAK">
                    <name>F2IPEAK</name>
                    <description>IPEAK Result register</description>
                    <addressOffset>0x000000F0</addressOffset>
                </register>
                <register derivedFrom="F0VDAT">
                    <name>F2VDAT</name>
                    <description>VDAT Result register</description>
                    <addressOffset>0x000000F4</addressOffset>
                </register>
                <register derivedFrom="F0I0DAT">
                    <name>F2IDAT</name>
                    <description>IDAT Result register</description>
                    <addressOffset>0x000000F8</addressOffset>
                </register>
                <register derivedFrom="F0VRMS">
                    <name>F2VRMS</name>
                    <description>VRMS Result register</description>
                    <addressOffset>0x000000FC</addressOffset>
                </register>
                <register derivedFrom="F0VRMS2">
                    <name>F2VRMS2</name>
                    <description>VRMS^2 Result register</description>
                    <addressOffset>0x00000100</addressOffset>
                </register>
                <register derivedFrom="F0IRMS">
                    <name>F2IRMS</name>
                    <description>IRMS Result register</description>
                    <addressOffset>0x00000104</addressOffset>
                </register>
                <register derivedFrom="F0IRMS2">
                    <name>F2IRMS2</name>
                    <description>IRMS^2 Result register</description>
                    <addressOffset>0x00000108</addressOffset>
                </register>
                <register derivedFrom="F1STAT">
                    <name>F2STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x0000010C</addressOffset>
                </register>
                <register derivedFrom="F1MASK">
                    <name>F2MASK</name>
                    <description>IRQ Mask Register</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>32</size>
                </register>
                <register>
                    <name>CCAL1</name>
                    <description>Calibration Register 1</description>
                    <addressOffset>0x00000114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>V0BGAIN</name>
                            <description>V0 calibration gain</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>I0BGAIN</name>
                            <description>I0 calibration gain</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL2</name>
                    <description>Calibration Register 2</description>
                    <addressOffset>0x00000118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>V1BGAIN</name>
                            <description>V1 calibration gain</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>I1BGAIN</name>
                            <description>I1 calibration gain</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL3</name>
                    <description>Calibration Register 3</description>
                    <addressOffset>0x0000011C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>V2BGAIN</name>
                            <description>V2 calibration gain</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>I2BGAIN</name>
                            <description>I2 calibration gain</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL4</name>
                    <description>Calibration Register 4</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>I3BGAIN</name>
                            <description>I3 calibration gain</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
