anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F21QI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTB</name>
            <description>PORTB</description>
            <groupName>PORT</groupName>
            <baseAddress>0x40088000</baseAddress>
            <interrupt>
                <name>EXT_INT1_IRQ</name>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>EXT_INT2_IRQ</name>
                <value>13</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="MDR_PORTA">
            <name>MDR_PORTC</name>
            <description>PORTC</description>
            <groupName>PORT</groupName>
            <baseAddress>0x40090000</baseAddress>
        </peripheral>
        <peripheral>
            <name>MDR_CRC</name>
            <version>1.0</version>
            <description>CRC Controler</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40098000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x14</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CRC_CTRL</name>
                    <description>Control register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000</resetValue>
                    <resetMask>0x0000003F</resetMask>
                    <fields>
                        <field>
                            <name>CRCEN</name>
                            <description>Enable block</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAINV</name>
                            <description>Bit first selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>Low bit first</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>High bit first</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLSize</name>
                            <description>Loading data size</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8_bit</name>
                                    <description>Byte data stream</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_bit</name>
                                    <description>16-bit data stream</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32_bit</name>
                                    <description>32-bit data stream</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DCSize</name>
                            <description>Calculating data size</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8_bit</name>
                                    <description>Byte data word</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_bit</name>
                                    <description>16-bit data word</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32_bit</name>
                                    <description>32-bit data word</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC_STAT</name>
                    <description>Status register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>CONVCOMP</name>
                            <description>Convertion Completed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Processing</name>
                                    <description>Calculation processing</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Completed</name>
                                    <description>Calculation completed or FIFO is empty or block inactive</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOFULL</name>
                            <description>FIFO Full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFOEMPTY</name>
                            <description>FIFO Empty</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFOOVER</name>
                            <description>FIFO Over</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC_DATAI</name>
                    <description>FIFO Input</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Value</name>
                            <description>Data Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC_VAL</name>
                    <description>CRC result</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCOUT</name>
                            <description>Result or Start Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC_POL</name>
                    <description>CRC Polinom select</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000</resetValue>
                    <resetMask>0x0001FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRC_POL</name>
                            <description>Select polinom bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
